{
  "page": {
    "title": "FBO Services at Eagle East Aviation",
    "description": "Experience premium FBO services with Eagle East Aviation. Our dedicated ground team provides top-tier solutions tailored to your needs. From private charters and aircraft management to concierge and hospitality services, we ensure a seamless and luxurious aviation experience. Explore our full range of services below."
  },
  "sections": [
    {
      "id": "titan-fuel",
      "title": "Titan Fuel",
      "order": 1,
      "layout": "image-left",
      "background": "white",
      "content": [
        "Eagle East Aviation is proud to partner with <strong>Titan Fuel</strong>, a trusted name in aviation fueling. With their commitment to quality and reliability, we ensure that every aircraft receives top-tier <strong>JET A and 100LL fuel</strong>.",
        "Titan Fuel helps us keep you flying safely and efficiently."
      ],
      "image": {
        "src": "/images/Titan_Fuel_v=1740585614&width=1500.jpg",
        "alt": "Titan Fuel partnership at Eagle East Aviation",
        "isCircular": true
      }
    },
    {
      "id": "fueling-oil-services", 
      "title": "Fueling & Oil Services",
      "order": 2,
      "layout": "image-right",
      "background": "white",
      "content": [
        "Keep your aircraft ready for takeoff with Eagle East Aviation's top-quality fueling services. We offer <strong>JET A</strong> and <strong>100LL</strong> aviation fuel to meet the needs of both turbine and piston-engine aircraft.",
        "Our reliable and efficient fueling ensures optimal performance for every flight. Additionally, we provide a selection of high-quality aviation oils to keep your engine running smoothly. Trust our team for safe, professional, and timely service."
      ],
      "image": {
        "src": "/images/5J6A0650_v=1740494543&width=1500.jpg",
        "alt": "Aircraft fueling services at Eagle East Aviation"
      }
    },
    {
      "id": "jet-services",
      "title": "Jet Services", 
      "order": 3,
      "layout": "image-left",
      "background": "white",
      "content": [
        "Get your aircraft ready for a flawless flight with Eagle East Aviation's Jet Preparation Services. We offer a range of services designed to ensure comfort, safety, and efficiency for every journey:"
      ],
      "services": [
        {
          "name": "De-icing",
          "description": "Essential winter services to ensure safe takeoff"
        },
        {
          "name": "Lavatory servicing", 
          "description": "Clean and fully stocked for your convenience"
        },
        {
          "name": "Catering",
          "description": "Custom catering options to suit your preferences"
        },
        {
          "name": "Flight Planning Assistance",
          "description": "Tailored support for your trip logistics"
        }
      ],
      "closing": "<strong>Trust us to handle the details, so you can enjoy a seamless flight experience.</strong>",
      "image": {
        "src": "/images/5J6A0667_v=1740495019&width=3840.jpg",
        "alt": "Jet services and aircraft preparation at Eagle East Aviation"
      }
    },
    {
      "id": "lounge-concierge",
      "title": "Lounge & Concierge",
      "order": 4, 
      "layout": "image-right",
      "background": "white",
      "content": [
        "Relax in our comfortable <strong>Lounge & Concierge</strong> area with <strong>free Wi-Fi</strong> and snacks. Our friendly staff is always eager to assist, and we offer a <strong>company car</strong> for pilots and <strong>rental car</strong> arrangements for both pilots and passengers. Enjoy convenience and comfort during your visit."
      ],
      "image": {
        "src": "/images/Lounge_b5e14376-d8b1-433a-978f-be8767cda182_v=1744286358&width=3840.jpg",
        "alt": "Eagle East Aviation pilot lounge and concierge area"
      }
    }
  ],
  "meetTheCrew": {
    "title": "Meet The Crew",
    "description": "Our experienced team is here to provide professional aviation services and support.",
    "showInstructors": true
  }
}