{
  "headline": "See What Our Customers Are Saying About Us",
  "reviews": [
    {
      "name": "Bendrix Bailey",
      "credentials": "MEL, SEL, SES, Glider, IFR Commercial 2,000+ hours",
      "quote": "I've been trusting my airplanes to Yankee Aviation for as long as I've been based in Plymouth; over 10 years. Peter Conner and his crew have saved me money and trouble by finding problems in the shop, before they become problems in the air. Yankee has also handled some tricky custom work on my Cessna 185, including P-Ponk strut reinforcements, folding rear jump seats and ski installation. Yankee has never turned me down when I needed quick-turn, unscheduled maintenance, and they've done it with no extra charges. My annuals are completed on schedule, and I don't find loose screws or other problems afterward, like I have elsewhere. Pete Conner and his Yankee Aviation crew will be doing my maintenance so long as we're both active in aviation. His is the only shop I'd trust to keep the airplanes that carry my wife and children, safely in the air.",
      "rating": 5
    },
    {
      "name": "Mark C Mannix",
      "credentials": "",
      "quote": "I came to know Pete Conner and Yankee Aviation Services almost twenty years ago. He was recommended to me by Bob at Dorr Aviation to do a pre-buy inspection on a 172xp I was buying. He did a great job then and has serviced my airplanes since. Pete flies himself and is an FAA mechanic examiner. He knows the expense of operating an airplane. Allow me a story: I was returning from Montreal with my three sons when landing at HVN we experienced a landing gear problem in my Piper Saratoga. The emergency procedure is a gravity system and we were able to land safely. The FBO there told me that it was a power pack problem and would be $4500 to fix. I took the plane to Yankee Aviation and they replaced a $12 brush in the motor assembly. I would recommend Pete Conner and Yankee Aviation Services to anyone.",
      "rating": 5
    }
  ]
}