{
  "heading": "Our Team",
  "subheading": "",
  "description": "",
  "members": [
    {
      "id": "peter-conner",
      "name": "Peter Conner",
      "role": "",
      "image": "/images/team/peter-conner.jpg",
      "imageAlt": "Peter Conner working at his desk in the Yankee Aviation office",
      "shortBio": "After getting his private and commercial flying ratings, Pete initially hoped to become an airline pilot. When that did not work out, he was happy to use his mechanic's licenses which he had obtained shortly after graduating from high school.\n\nFrom 1965 on, it has been nonstop aircraft maintenance with some occasional flight instruction mixed in. While still in the Navy in 1968, he became an authorized inspector while attached to the Baltimore, MD office of the FAA.",
      "fullBio": "In 1986, after a considerable application process to the FAA, Pete was appointed as a Designated Airworthiness Representative (DAR) for maintenance by the Boston office of the FAA. He is one of only a handful of folks in the New England area with this honor. Many of the functions he is allowed to perform on behalf of the FAA are listed on our home page.\n\nIn 1988, Pete was also designated as an Examiner for mechanic applicants by the FAA. He is currently affiliated as an examiner with National Aviation Academy located in Bedford, MA. But in 1996, he received an award he is most proud of: the \"Mechanic of the Year\" for the New England Region of the FAA.\n\nPete, being an active pilot and instructor, is always happy to share his knowledge of general aviation and just talk about \"flying\" in general. Having owned over 25 different airplanes, he has a fairly good grasp on some of the idiosyncrasies of many aircraft. He has attended several aircraft maintenance schools while in the Navy and civilian world. Some of those include Cessna 300/400 series, Piper Aerostar, Single-Engine Cessna, and most recently the Eclipse 500 school. Currently, he enjoys owning and flying a Piper Aerostar 700."
    },
    {
      "id": "gail-conner",
      "name": "Gail Conner",
      "role": "Office Manager",
      "image": "/images/team/gail-conner.jpg",
      "imageAlt": "Gail Conner, Office Manager at Yankee Aviation",
      "shortBio": "As most of you know, my wife, Gail is our office manager. She has been in that position since 1980 and \"yes\" amazingly, we still manage to work quite well with each other! She is the pleasant voice you usually hear when you call. It is surprising how much she knows about your aircraft and the parts that make it up. Running this business definitely would not be possible without her help."
    },
    {
      "id": "ken-hughes", 
      "name": "Ken Hughes",
      "role": "Lead Mechanic",
      "image": "/images/team/ken-hughes.jpg",
      "imageAlt": "Ken Hughes, Lead Mechanic at Yankee Aviation",
      "shortBio": "After earning his mechanic certificates in 1985, Ken worked for Provincetown Boston Airlines. After a short time with the Hyannis airline, he decided to join Yankee Aviation Services. It is hard to believe that was more than 33 years ago. Ken's skillful mechanical abilities clearly demonstrate his position as our \"lead mechanic.\" He earned his Inspection Authorization from the FAA in 1996 and is one of the more highly respected inspectors in the Boston District. Ken's specialties are engine removal and installation, troubleshooting electrical problems, and dynamic propeller balancing. Ken spends considerable amounts of his off-time working around his house and is a faithful follower of the NFL."
    },
    {
      "id": "joe-ricci",
      "name": "Joe Ricci", 
      "role": "",
      "image": "/images/team/joe-ricci.jpg",
      "imageAlt": "Joe Ricci at Yankee Aviation",
      "shortBio": "Joe Ricci is our newest addition to the Yankee crew. Joe is a graduate of the Cape Cod Community College Aviation curriculum where he earned his FAA Airframe and Powerplant license. He has been with us about 3 years. But Joe is no stranger to General Aviation. He not only is a licensed pilot and owns a Cessna but managed the Pilgrim Aviation Flight School for several years. Joe has quickly adapted to our operation and is an excellent addition to the staff."
    },
    {
      "id": "hank-wiltshire",
      "name": "Hank Wiltshire",
      "role": "",
      "image": "/images/team/hank-wiltshire.jpg", 
      "imageAlt": "Hank Wiltshire at Yankee Aviation",
      "shortBio": "Henry \"Hank\" Wiltshire joined Yankee Aviation Services over 20 years ago\nafter operating a flight school and charter operation at Plymouth Airport. Hank has been a licensed A&P mechanic since 1973 and actually was first introduced to flying over 50 years ago. He has owned many aircraft and currently flies a Cessna 172 which he has also configured for float operations. Hank's vast experience with owning and repairing his own aircraft provides him with a unique perspective to share with our customers. While Hank loves to fly, he also enjoys relaxing in the woods of Maine while in pursuit of that elusive deer! He is enjoying a degree of retirement these days but does come into the shop to help us out when we need him! We appreciate that!"
    }
  ]
}